package Development;

public class Tasks {
    /*
    ✔️ Создать карту с нодами
    ✔️ Сгенерить связанные по всем направлениям узлы

    Сделать пустые ячейки
    Мув у живых существ
    Поиск овцой травы\ поиск медведем овцу\ проверка что овца все еще на той же клетке
    Движение овцы к траве
    Запретить ходить на камень



    рандомно раскидать по карте декор

    сделать для всех живых существ движение
        поиск еды, движение к ней, поедание и исчезновение еды
    сделать логи действий

// как сделать карту?
    привязать к клетке массива ноду?

    1. овца с 1 конца карты идет к траве в другую часть

    2. овца обходит камни

    3. овца идет к траве, а медведь идет за овцой убивать


    задать количество сущностей
    задать рандомный спавн в узлах

    ход в мире останавливается вводом юзером любого знака

     */
}
