package Development;

public class Tasks {
    /*

    сгенерить связанные по всем направлениям узлы

    рандомно раскидать по карте декор

    сделать для всех живых существ движение
        поиск еды, движение к ней, поедание и исчезновение еды
    сделать логи действий

// как сделать карту?
    привязать к клетке массива ноду?

    1. овца с 1 конца карты идет к траве в другую часть

    2. овца обходит камни

    3. овца идет к траве, а медведь идет за овцой убивать


    задать количество сущностей
    задать рандомный спавн в узлах

    ход в мире останавливается вводом юзером любого знака

     */
}
