package Development;

public class Tasks {
    /*
    ✔️ Создать карту с нодами
    ✔️ Сгенерить связанные по всем направлениям узлы
    ✔️ Сделать пустые ячейки
    ✔️ Мув у живых существ
    ️ ✔️ Архитектурная настройка
    ✔️ Запретить ходить на камень
    ✔️ Реализовать атаку
    ✔️ ход в мире продолжается вводом юзером любого знака

    exceptions
    рандомный спавн по карте


    Поиск овцой травы\ поиск медведем овцу\ проверка что овца все еще на той же клетке

    рандомно раскидать по карте декор

    сделать для всех живых существ движение


    задать количество сущностей
    задать рандомный спавн в узлах



     */
}
